app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("titulo", "descricao", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["titulo", "teste"], ["descricao", "verificando rails"], ["created_at", "2019-05-14 18:43:40.700296"], ["updated_at", "2019-05-14 18:43:40.700296"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "descricao" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["descricao", "verificando ruby"], ["updated_at", "2019-05-14 18:44:55.937586"], ["id", 1]]